//===========================================================================================================================//
//===何文字以下・以上の条件プログラム===//
//【var n = 任意の反応させたい数字】でnの値を指定しています。

//===何文字以下===//
//【if(msg.content.length <= n) {】でn文字以下の数値の場合という条件を付与しています。)
var n = 任意の反応させたい数字
if(msg.content.length <= n) {
}

//===何文字以上===//
//【if(msg.content.length >= n) {】でn文字以上の数値の場合という条件を付与しています。)
var n = 任意の反応させたい数字
if(msg.contect.length >= n) {
}

//===========================================================================================================================//
bot.on('guildMemberAdd', (guild, member) => {
    bot.createMessage('428884489738125324', {
        embed: {
            author: {
                name: member.user.username + 'さんoyatyu-serverへようこそ！',
                url: 'https://discord.gg/pWkJeHs',
            },
            title: 'ここをクリックで参加希望部のアンケートに飛びます。', 
            url: 'https://goo.gl/forms/6lFkWrpNr43iEzBC2',
        },
        description: '本鯖の説明等は全てBOTのコマンドで行っています。\n<#445121154915500032>にて .os:h1 と書き込んでコマンドの確認をしてください。',
        
        timestamp: new Date(),
    })
})